In [25]:
#importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [26]:
df.sample(5, random_state=76)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
721995,Data Engineer,Sr. Data Engineer,"San Leandro, CA",via WANE Jobs,Full-time,False,"Illinois, United States",2023-05-28 21:07:01,False,False,United States,year,151840.0,NaN,Supernal,"['sql', 'snowflake', 'bigquery', 'aws', 'redsh...","{'cloud': ['snowflake', 'bigquery', 'aws', 're..."
179568,Data Scientist,"Data Scientist, Appstore","Chennai, Tamil Nadu, India",via Indeed,Full-time,False,India,2023-10-27 15:09:58,False,False,India,None,NaN,NaN,ADCI MAA 15 SEZ,"['sql', 'python', 'r', 'sas', 'sas', 'matlab',...","{'analyst_tools': ['sas', 'tableau'], 'cloud':..."
230998,Senior Data Engineer,Senior Data Engineer,Poland,via LinkedIn,Contractor,False,Poland,2023-07-14 07:25:41,False,False,Poland,None,NaN,NaN,Work Life Group,"['sql', 'sql server', 'azure', 'ssis']","{'analyst_tools': ['ssis'], 'cloud': ['azure']..."
367696,Data Analyst,Data Analyst,"Dublin, Ireland",via Recruit.net,Full-time,False,Ireland,2023-07-14 23:52:32,True,False,Ireland,None,NaN,NaN,Aspira,None,None
684564,Data Analyst,Data Analyst,Hong Kong,via Trabajo.org,Full-time,False,Hong Kong,2023-07-29 10:20:00,True,False,Hong Kong,None,NaN,NaN,Swing Consulting Ltd.,"['python', 'tableau']","{'analyst_tools': ['tableau'], 'programming': ..."

In [27]:
df_altered = df.copy()

In [29]:
median_salary = df_altered['salary_year_avg'].median()

In [30]:
df_altered['salary_year_avg']=df_altered['salary_year_avg'].fillna(median_salary)

In [31]:
df_altered.loc[:5,'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64